case = {
    "nomn": "Именительный",
    "gent": "Родительный",
    "datv": "Дательный",
    "accs": "Винительный",
    "ablt": "Творительный",
    "loct": "Предложный",
    "voct": "Звательный",
    "gen2": "Второй родительный (частичный)",
    "acc2": "Второй винительный",
    "loc2": "Второй предложный (местный)"
}

pos = {
    "NOUN": "Существительное",
    "ADJF": "Прилагательное (полное)",
    "ADJS": "Прилагательное (краткое)",
    "COMP": "Компаратив",
    "VERB": "Глагол (личная форма)",
    "INFN": "Глагол (инфинитив)",
    "PRTF": "Причастие (полное)",
    "PRTS": "Причастие (краткое)",
    "GRND": "Деепричастие",
    "NUMR": "Числительное",
    "ADVB": "Наречие",
    "NPRO": "Местоимение-существительное",
    "PRED": "Предикатив",
    "PREP": "Предлог",
    "CONJ": "Союз",
    "PRCL": "Частица",
    "INTJ": "Междометие"
}

number = {
    "sing": "Единственное",
    "plur": "Множественное"
}

anim = {
    "anim": "Одушевлённое",
    "inan": "Неодушевлённое"
}

gender = {
    "masc": "Мужской",
    "femn": "Женский",
    "neut": "Средний"
}

dtime = {
    "pres": "Настроящее",
    "past": "Прошедшее",
    "futr": "Будущее"
}

prilset = {
    "Qual": "Качественное", 
    "Poss": "Притяжательное"
}

razrmest = {
    "Refl": "Возвратное",
    "Poss": "Притяжательное",
    "Ques": "Вопросительное",
    "Dmns": "Указательное"
}

razrmesttwo = {
    "Refl": "Возвратный",
    "Poss": "Притяжательный",
    "Ques": "Вопросительный",
    "Dmns": "Указательный",
    "Supr": "Превосходный",
    "Cmp2": "Сравнительная степень"
}

sov = {
    "perf": "Совершенный",
    "impf": "Несовершенный"
}

perexod = {
    "intr": "Непереходный",
    "tran": "Переходный"
}

mood = {
    "indc": "Изъявительное",
    "impr": "Повелительное"
}

pvoice = {
    "actv": "Действительный",
    "pssv": "Страдательный"
}

ismain = ["Name", "Surn", "Patr", "Geox", "Orgn", "Trad"]